; domain
(define (domain dummy)
  (:requirements :strips)
  (:predicates (connected ?x ?y)
	       (at ?x)
  )

  (:action go
	     :parameters (?x ?y)
	     :precondition (and (at ?x) (connected ?x ?y))
	     :effect
	     (and (not (at ?x)) (at ?y) (not (connected ?x ?y)))

  )

)

; problem
(define (problem n-45)
(:domain dummy)
(:objects n1 r1 n2 r2 n3 r3 n4 r4 n5 r5 n6 r6 n7 r7 n8 r8 n9 r9 n10 r10 n11 r11 n12 r12 n13 r13 n14 r14 n15 r15 n16 r16 n17 r17 n18 r18 n19 r19 n20 r20 n21 r21 n22 r22 n23 r23 n24 r24 n25 r25 n26 r26 n27 r27 n28 r28 n29 r29 n30 r30 n31 r31 n32 r32 n33 r33 n34 r34 n35 r35 n36 r36 n37 r37 n38 r38 n39 r39 n40 r40 n41 r41 n42 r42 n43 r43 n44 r44 n45)
(:init
(at n1)
(connected n1 n2)
(connected n1 r1)
(connected r1 n2)
(connected n2 n3)
(connected n2 r2)
(connected r2 n3)
(connected n3 n4)
(connected n3 r3)
(connected r3 n4)
(connected n4 n5)
(connected n4 r4)
(connected r4 n5)
(connected n5 n6)
(connected n5 r5)
(connected r5 n6)
(connected n6 n7)
(connected n6 r6)
(connected r6 n7)
(connected n7 n8)
(connected n7 r7)
(connected r7 n8)
(connected n8 n9)
(connected n8 r8)
(connected r8 n9)
(connected n9 n10)
(connected n9 r9)
(connected r9 n10)
(connected n10 n11)
(connected n10 r10)
(connected r10 n11)
(connected n11 n12)
(connected n11 r11)
(connected r11 n12)
(connected n12 n13)
(connected n12 r12)
(connected r12 n13)
(connected n13 n14)
(connected n13 r13)
(connected r13 n14)
(connected n14 n15)
(connected n14 r14)
(connected r14 n15)
(connected n15 n16)
(connected n15 r15)
(connected r15 n16)
(connected n16 n17)
(connected n16 r16)
(connected r16 n17)
(connected n17 n18)
(connected n17 r17)
(connected r17 n18)
(connected n18 n19)
(connected n18 r18)
(connected r18 n19)
(connected n19 n20)
(connected n19 r19)
(connected r19 n20)
(connected n20 n21)
(connected n20 r20)
(connected r20 n21)
(connected n21 n22)
(connected n21 r21)
(connected r21 n22)
(connected n22 n23)
(connected n22 r22)
(connected r22 n23)
(connected n23 n24)
(connected n23 r23)
(connected r23 n24)
(connected n24 n25)
(connected n24 r24)
(connected r24 n25)
(connected n25 n26)
(connected n25 r25)
(connected r25 n26)
(connected n26 n27)
(connected n26 r26)
(connected r26 n27)
(connected n27 n28)
(connected n27 r27)
(connected r27 n28)
(connected n28 n29)
(connected n28 r28)
(connected r28 n29)
(connected n29 n30)
(connected n29 r29)
(connected r29 n30)
(connected n30 n31)
(connected n30 r30)
(connected r30 n31)
(connected n31 n32)
(connected n31 r31)
(connected r31 n32)
(connected n32 n33)
(connected n32 r32)
(connected r32 n33)
(connected n33 n34)
(connected n33 r33)
(connected r33 n34)
(connected n34 n35)
(connected n34 r34)
(connected r34 n35)
(connected n35 n36)
(connected n35 r35)
(connected r35 n36)
(connected n36 n37)
(connected n36 r36)
(connected r36 n37)
(connected n37 n38)
(connected n37 r37)
(connected r37 n38)
(connected n38 n39)
(connected n38 r38)
(connected r38 n39)
(connected n39 n40)
(connected n39 r39)
(connected r39 n40)
(connected n40 n41)
(connected n40 r40)
(connected r40 n41)
(connected n41 n42)
(connected n41 r41)
(connected r41 n42)
(connected n42 n43)
(connected n42 r42)
(connected r42 n43)
(connected n43 n44)
(connected n43 r43)
(connected r43 n44)
(connected n44 n45)
(connected n44 r44)
(connected r44 n45)
)
(:goal
(at n45)
)
)

; plan
1. (go n1 n2)
   deleted: (at n1) (connected n1 n2)
   added: (at n2)
   goals met: 0 of 1
2. (go n2 n3)
   deleted: (at n2) (connected n2 n3)
   added: (at n3)
   goals met: 0 of 1
3. (go n3 n4)
   deleted: (at n3) (connected n3 n4)
   added: (at n4)
   goals met: 0 of 1
4. (go n4 n5)
   deleted: (at n4) (connected n4 n5)
   added: (at n5)
   goals met: 0 of 1
5. (go n5 n6)
   deleted: (at n5) (connected n5 n6)
   added: (at n6)
   goals met: 0 of 1
6. (go n6 n7)
   deleted: (at n6) (connected n6 n7)
   added: (at n7)
   goals met: 0 of 1
7. (go n7 n8)
   deleted: (at n7) (connected n7 n8)
   added: (at n8)
   goals met: 0 of 1
8. (go n8 n9)
   deleted: (at n8) (connected n8 n9)
   added: (at n9)
   goals met: 0 of 1
9. (go n9 n10)
   deleted: (at n9) (connected n9 n10)
   added: (at n10)
   goals met: 0 of 1
10. (go n10 n11)
   deleted: (at n10) (connected n10 n11)
   added: (at n11)
   goals met: 0 of 1
11. (go n11 n12)
   deleted: (at n11) (connected n11 n12)
   added: (at n12)
   goals met: 0 of 1
12. (go n12 n13)
   deleted: (at n12) (connected n12 n13)
   added: (at n13)
   goals met: 0 of 1
13. (go n13 n14)
   deleted: (at n13) (connected n13 n14)
   added: (at n14)
   goals met: 0 of 1
14. (go n14 n15)
   deleted: (at n14) (connected n14 n15)
   added: (at n15)
   goals met: 0 of 1
15. (go n15 n16)
   deleted: (at n15) (connected n15 n16)
   added: (at n16)
   goals met: 0 of 1
16. (go n16 n17)
   deleted: (at n16) (connected n16 n17)
   added: (at n17)
   goals met: 0 of 1
17. (go n17 n18)
   deleted: (at n17) (connected n17 n18)
   added: (at n18)
   goals met: 0 of 1
18. (go n18 n19)
   deleted: (at n18) (connected n18 n19)
   added: (at n19)
   goals met: 0 of 1
19. (go n19 n20)
   deleted: (at n19) (connected n19 n20)
   added: (at n20)
   goals met: 0 of 1
20. (go n20 n21)
   deleted: (at n20) (connected n20 n21)
   added: (at n21)
   goals met: 0 of 1
21. (go n21 n22)
   deleted: (at n21) (connected n21 n22)
   added: (at n22)
   goals met: 0 of 1
22. (go n22 n23)
   deleted: (at n22) (connected n22 n23)
   added: (at n23)
   goals met: 0 of 1
23. (go n23 n24)
   deleted: (at n23) (connected n23 n24)
   added: (at n24)
   goals met: 0 of 1
24. (go n24 n25)
   deleted: (at n24) (connected n24 n25)
   added: (at n25)
   goals met: 0 of 1
25. (go n25 n26)
   deleted: (at n25) (connected n25 n26)
   added: (at n26)
   goals met: 0 of 1
26. (go n26 n27)
   deleted: (at n26) (connected n26 n27)
   added: (at n27)
   goals met: 0 of 1
27. (go n27 n28)
   deleted: (at n27) (connected n27 n28)
   added: (at n28)
   goals met: 0 of 1
28. (go n28 n29)
   deleted: (at n28) (connected n28 n29)
   added: (at n29)
   goals met: 0 of 1
29. (go n29 n30)
   deleted: (at n29) (connected n29 n30)
   added: (at n30)
   goals met: 0 of 1
30. (go n30 n31)
   deleted: (at n30) (connected n30 n31)
   added: (at n31)
   goals met: 0 of 1
31. (go n31 n32)
   deleted: (at n31) (connected n31 n32)
   added: (at n32)
   goals met: 0 of 1
32. (go n32 n33)
   deleted: (at n32) (connected n32 n33)
   added: (at n33)
   goals met: 0 of 1
33. (go n33 n34)
   deleted: (at n33) (connected n33 n34)
   added: (at n34)
   goals met: 0 of 1
34. (go n34 n35)
   deleted: (at n34) (connected n34 n35)
   added: (at n35)
   goals met: 0 of 1
35. (go n35 n36)
   deleted: (at n35) (connected n35 n36)
   added: (at n36)
   goals met: 0 of 1
36. (go n36 n37)
   deleted: (at n36) (connected n36 n37)
   added: (at n37)
   goals met: 0 of 1
37. (go n37 n38)
   deleted: (at n37) (connected n37 n38)
   added: (at n38)
   goals met: 0 of 1
38. (go n38 n39)
   deleted: (at n38) (connected n38 n39)
   added: (at n39)
   goals met: 0 of 1
39. (go n39 n40)
   deleted: (at n39) (connected n39 n40)
   added: (at n40)
   goals met: 0 of 1
40. (go n40 n41)
   deleted: (at n40) (connected n40 n41)
   added: (at n41)
   goals met: 0 of 1
41. (go n41 n42)
   deleted: (at n41) (connected n41 n42)
   added: (at n42)
   goals met: 0 of 1
42. (go n42 n43)
   deleted: (at n42) (connected n42 n43)
   added: (at n43)
   goals met: 0 of 1
43. (go n43 n44)
   deleted: (at n43) (connected n43 n44)
   added: (at n44)
   goals met: 0 of 1
44. (go n44 n45)
   deleted: (at n44) (connected n44 n45)
   added: (at n45)
   goals met: 1 of 1
